app/controllers/article_controller.rb

  def show
    article = Article.where(id: params["id"])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]